set names=utf8;
drop database if exists xinwen;
create database xinwen charset=utf8;
use xinwen;

-- 第一个表
create table zongbuxinwen(uid int,title varchar(1024),date varchar(32));

insert into zongbuxinwen values
(1,'厉行节约 反对浪费 | 联社机关支部主题党日发出倡议','2020-10-24'),
(2,'区供销联社机关支部半年度组织生活会辣味十足','2020-10-24'),
(3,'区供销联社全员备战，迅速行动，吹响防汛集结号','2020-10-24'),
(4,'全区供销系统安全生产和消防安全半年度工作例会召开','2020-10-21'),
(5,'全区供销系统消防应急疏散和灭火实操演练举行','2020-10-21'),
(6,'区供销联社机关支部开展固定主题党日活动','2020-10-14'),
(7,'区供销联社机关妇联开展“迎端午·包粽子”活动','2020-10-14'),
(8,'萧山区供销联社机关志愿服务队走进田间地头','2020-10-04'),
(9,'区供销联社直面挑战，全力开展大件垃圾清运工作','2020-10-04'),
(10,'全区供销系统安全参观体验活动顺利开展','2020-10-3'),
(11,'区人大常委会主任裘超视察指导大江东种子种苗科技示范基地','2020-10-2'),
(12,'区供销联社积极参加2020年萧山区水库防洪应急演练','2020-10-24'),
(13,'区政协专题视察区供销联社大件垃圾收运处置工作','2020-10-1');

-- 第二个表
create table hexinyewu(uid int,title varchar(32),img varchar(128));

insert into hexinyewu values
(1,'为农服务板块','./img/01.jpg'),
(2,'石油经营板块','./img/02.jpg'),
(3,'医药健康板块','./img/03.jpg'),
(4,'资产经营板块','./img/04.jpg'),
(5,'再生资源板块','./img/05.jpg'),
(6,'工贸旅游板块','./img/06.jpg');