set names=utf8;
drop database if exists xinwen;
create database xinwen charset=utf8;
use xinwen;
create table news(uid int,title varchar(1024));

insert into news value
(1,'厉行节约 反对浪费 | 联社机关支部主题党日发出倡议'),
(2,'区供销联社机关支部半年度组织生活会辣味十足'),
(3,'区供销联社全员备战，迅速行动，吹响防汛集结号'),
(4,'全区供销系统安全生产和消防安全半年度工作例会召开'),
(5,'全区供销系统消防应急疏散和灭火实操演练举行'),
(6,'区供销联社机关支部开展固定主题党日活动'),
(7,'区供销联社机关妇联开展“迎端午·包粽子”活动'),
(8,'萧山区供销联社机关志愿服务队走进田间地头'),
(9,'区供销联社直面挑战，全力开展大件垃圾清运工作'),
(10,'全区供销系统安全参观体验活动顺利开展'),
(11,'区人大常委会主任裘超视察指导大江东种子种苗科技示范基地'),
(12,'区供销联社积极参加2020年萧山区水库防洪应急演练'),
(13,'区政协专题视察区供销联社大件垃圾收运处置工作');
